# _*_ coding: utf-8 _*_
"""
Time:     2023/5/30 16:28
Author:   Xienuli
File:     chapter6-1.py
"""
#列选择
import pandas as pd
#创建一个字典数据data，其中包含编号、年龄、性别和注册时间4个字段
data = {'订单编号': ['A1', 'A2', 'A3', 'A4', 'A5'],
        '客户姓名': ['张通', '李谷', '孙凤', '赵恒',  '赵恒'],
        '唯一识别码':['101', '102', '103', '104', '104'],
        '成交时间':['2018/8/8','2018/8/9','2018/8/10','2018/8/11','2018/8/12'],
        '销售ID':['1', '2', '1', '2', '3']}
#将字典类型的数据转化为DataFrame数据表，并赋值给df
df = pd.DataFrame(data)
#将数据保存在excel文件中，不包含行索引
df.to_excel(r'table6-01.xlsx', index=False)
#从表格中读取数据，赋值给df
df = pd.read_excel(r"table6-01.xlsx")
#传入一个列名
print(df["订单编号"])
#传入多个列名字
print(df[["订单编号","客户姓名"]])
#通过传入位置来获取数据时需要用到iloc方法
print(df.iloc[:,[0,2]])#获取第1列和第3列的数值
print(df.iloc[:,0:3])#获取第1列和第3列的数值

